code-review/NRB_3471_3546/База_Стало/InformationRegisters/СостоянияРасчетаРыночныхЦенЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияРасчетаРыночныхЦенЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРасчетаРыночныхЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапросаBQ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапросаDiasoft</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолученОтветBQ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолученОтветDiasoft</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Регламент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодикиРасчетаРыночныхЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/СостоянияРасчетаРыночныхЦенЦенныхБумаг/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значения всех ресурсов\реквизитов найденной записи или конкретного ресурса если указано его имя
// Параметры:
//  СквозныеПараметры	 - Структура - Структура, содержащая как минимум следующие элементы идентифицирующие расчет:
//  ----.*ДатаРасчета		 - Дата											 - Дата расчета
//  ----.*МетодикаРасчета	 - ПеречислениеСсылка.МетодикиРасчетаРыночныхЦен - Методика по которой производится расчет
//  ----.*Регламент			 - Булево										 - Признак основного расчета
//  ИмяРесурсаРеквизита	 - Строка - Имяресурса\реквизита, значение которого надо вернуть
// 
// Возвращаемое значение:
//  Структура - структура содержащая значения всех ресурсов\реквизитов найденой записи, или произвольное
//
Функция ПолучитьСостояние(СквозныеПараметры, ИмяРесурсаРеквизита = Неопределено) Экспорт
	
	Отбор = Новый Структура("ДатаРасчета, Регламент, МетодикаРасчета", 
							СквозныеПараметры.ДатаРасчета, СквозныеПараметры.Регламент, СквозныеПараметры.МетодикаРасчета);
	
	Если ИмяРесурсаРеквизита <> Неопределено Тогда
		Возврат Получить(Отбор)[ИмяРесурсаРеквизита];
	Иначе
		Возврат Получить(Отбор);
	КонецЕсли;
	
КонецФункции

// Процедура - Установить состояние
//
// Параметры:
//  СквозныеПараметры			 - Структура - структура, описывающая параметры расчета и включающая как минимум:
//  ----.*ДатаРасчета					 - Дата												 - Дата расчета
//  ----.*МетодикаРасчета				 - ПеречислениеСсылка.МетодикиРасчетаРыночныхЦен	 - Методика, по которой производится расчет
//  ----.*Регламент						 - Булево								 			 - Признак основного расчета (по остаткам и без фильтра по ЦБ)
//  ----.*ПараметрыМетода				 - Строка	 - ПараметрыМетода
//  ----.*ИдентификаторЗапросаBQ		 - Строка	 - Гуид запроса через Kafka
//  ----.*ИдентификаторЗапросаDiasoft	 - Строка	 - Гуид запроса через Kafka
//  ----.*ПолученОтветBQ				 - Булево
//  ----.*ПолученОтветDiasoft			 - Булево
//  НовоеСостояние				 - ПеречислениеСсылка.СостоянияРасчетаРыночныхЦен	 - Устанавливаемое состояние
//  Комментарий					 - Строка	 - Комментарий
//
Процедура УстановитьСостояние(СквозныеПараметры, НовоеСостояние, Комментарий) Экспорт
	
	ДатаРасчета = СквозныеПараметры.ДатаРасчета;
	Регламент = СквозныеПараметры.Регламент;
	МетодикаРасчета = СквозныеПараметры.МетодикаРасчета;
	ПараметрыМетода = СквозныеПараметры.ПараметрыМетода;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ДатаРасчета.Установить(ДатаРасчета);
	НаборЗаписей.Отбор.Регламент.Установить(Регламент);
	НаборЗаписей.Отбор.МетодикаРасчета.Установить(МетодикаРасчета);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
	Иначе
		НоваяЗапись = НаборЗаписей.Получить(0);
	КонецЕсли;
	НоваяЗапись.ДатаРасчета				 = ДатаРасчета;
	НоваяЗапись.Регламент				 = Регламент;
	НоваяЗапись.МетодикаРасчета			 = МетодикаРасчета;
	НоваяЗапись.Состояние				 = НовоеСостояние;
	НоваяЗапись.ИдентификаторЗапросаBQ	 = СквозныеПараметры.ИдентификаторЗапросаBQ;
	НоваяЗапись.ИдентификаторЗапросаDiasoft = СквозныеПараметры.ИдентификаторЗапросаDiasoft;
	НоваяЗапись.ПолученОтветBQ			 = СквозныеПараметры.ПолученОтветBQ;
	НоваяЗапись.ПолученОтветDiasoft		 = СквозныеПараметры.ПолученОтветDiasoft;
	НоваяЗапись.ДатаИзменения			 = ТекущаяДатаСеанса();
	НоваяЗапись.Комментарий				 = Комментарий;
	НоваяЗапись.ПараметрыМетода			 = ПараметрыМетода;
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Функция - Описание незавершенного состояния основного расчета
//
// Параметры:
//  ОтчетныйРабочийПериод	 - Дата											 - Период определения состояния
//  МетодикаРасчета			 - ПеречислениеСсылка.МетодикиРасчетаРыночныхЦен - Методика по которой производится расчет
// 
// Возвращаемое значение:
//   - Строка - Описание незавершенного состояния расчета
//
Функция ОписаниеНезавершенногоСостоянияОсновногоРасчета(ОтчетныйРабочийПериод, МетодикаРасчета) Экспорт
	
	ОписаниеОшибки = "";
	КлючРасчета = Новый Структура("ДатаРасчета, МетодикаРасчета, Регламент",
							ОтчетныйРабочийПериод, МетодикаРасчета, Истина);
	СостояниеРасчета = ПолучитьСостояние(КлючРасчета, "Состояние");
	Если СостояниеРасчета <> Перечисления.СостоянияРасчетаРыночныхЦен.РасчетЗавершен Тогда
		ОписаниеОшибкиШаблон = "На %1 расчет рыночной цены по методике %2 не произведен / не завершен, текущий статус: [%3]";
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибкиШаблон,
			Формат(ОтчетныйРабочийПериод, "ДЛФ=D"),
			Строка(МетодикаРасчета),
			?(ЗначениеЗаполнено(СостояниеРасчета), СостояниеРасчета, "Не выполнялся"));
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

// Функция - Состояние расчета по идентификатору запроса
//
// Параметры:
//  ИдентификаторЗапроса - Строка	 - Идентификатор запроса BQ
//  ТекстОшибки			 - Строка	 - Текст ошибки
// 
// Возвращаемое значение:
//   - Структура- Запись регистра, найденая по идентификатору запроса
//
Функция СостояниеРасчетаПоИдентификаторуЗапроса(ИдентификаторЗапроса, ТекстОшибки) Экспорт
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
		ТекстОшибки = "Отсутствует идентификатор запроса от 1С: [ParentMessageId]";
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.ДатаРасчета КАК ДатаРасчета,
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.МетодикаРасчета КАК МетодикаРасчета,
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.Регламент КАК Регламент,
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.Состояние КАК Состояние,
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.ПараметрыМетода КАК ПараметрыМетода,
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.ИдентификаторЗапросаBQ КАК ИдентификаторЗапросаBQ,
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.ИдентификаторЗапросаDiasoft КАК ИдентификаторЗапросаDiasoft,
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.ПолученОтветBQ КАК ПолученОтветBQ,
	|	СостоянияРасчетаРыночныхЦенЦенныхБумаг.ПолученОтветDiasoft КАК ПолученОтветDiasoft
	|ИЗ
	|	РегистрСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг КАК СостоянияРасчетаРыночныхЦенЦенныхБумаг
	|ГДЕ
	|	(СостоянияРасчетаРыночныхЦенЦенныхБумаг.ИдентификаторЗапросаBQ = &ИдентификаторЗапроса
	|			ИЛИ СостоянияРасчетаРыночныхЦенЦенныхБумаг.ИдентификаторЗапросаDiasoft = &ИдентификаторЗапроса)";
	
	Запрос.УстановитьПараметр("ИдентификаторЗапроса", ИдентификаторЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = "В регистре состояний не найден запрос последней цены сделки по идентификатору [" + ИдентификаторЗапроса + "]";
		Возврат Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		СостояниеРасчета = Новый Структура;
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СостояниеРасчета.Вставить(Колонка.Имя, ВыборкаДетальныеЗаписи[Колонка.Имя]);
		КонецЦикла;
		Возврат СостояниеРасчета;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
